# Найдите хотя одно натуральное число, которое делится на 11, а при делении на 2,
# 3, 4, ..., 10 дает в остатке 1

for i in range(1000000):
    if i % 11 == 0:
        if i % 2 == 1:
            if i % 3 == 1:
                if i % 4 == 1:
                    if i % 5 == 1:
                        if i % 6 == 1:
                            if i % 7 == 1:
                                if i % 8 == 1:
                                    if i % 9 == 1:
                                        if i % 10 == 1:
                                            print(i)
