# Пользователь вводит номер месяца, вывести название месяца.

a = int(input('Введите номер месяца 1-12: '))
if a == 1:
    print('Январь')
elif a == 2:
    print('Февраль')
elif a == 3:
    print('Март')
elif a == 4:
    print('Апрель')
elif a == 5:
    print('Май')
elif a == 6:
    print('Июнь')
elif a == 7:
    print('Июль')
elif a == 8:
    print('Август')
elif a == 9:
    print('Сентябрь')
elif a == 10:
    print('Октябрь')
elif a == 11:
    print('Ноябрь')
elif a == 12:
    print('Декабрь')
