# Пользователь вводит одно целое число. Прибавить к нему 1 и вывести на экран.

# a = int(input('Введите число:  '))
# print(f'{a} + 1 = {a + 1}')

# Пользователь вводит одно целое число. Вывести остаток от деления этого числа на 7

# a = int(input('Введите целое число:  '))
# print(f'Остаток от деления {a} на 7 = {a % 7}')

# Пользователь вводит одну строку. Вывести символы со 2 по 5 включительно.
# Гарантируется, что длина строки не менее 5 символов. Помните, что в Python нумерация
# стартует с 0.
a = input()
print(a[1:5])
